OpenFOAM/OpenFOAM-5.x/tutorials/heatTransfer/buoyantSimpleFoam/externalCoupledCavity/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

runApplication decomposePar

runParallel $(getApplication) &

./externalSolver


#------------------------------------------------------------------------------
